{
   "title": "NOvember",
   "host": "House of Chastity",
   "year" : 2019,
   "subtitle": "Stuff it or Cover it in Gravy",
   "emoji": "lock",
   "thumbnail":"https://media.discordapp.net/attachments/548034641085595650/548034836053622795/image0.jpg?width=375&height=375",
   "description": "Posting challenge pics and videos encouraged as well as daily caged verification photos on discord & on twitter tag us @houseofchastity",
   "authors": {
      "maiden_syn" : {
         "name": "MaidenSyn🌈🦄",
         "id" : 473376960114982922,
         "url" : null,
         "icon" : null
      }
   },
   "tasks": [
      {
         "title": "Peniscan Pie",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "Fuck a pie. Share video.",
         "reward": "Immunity: 14 whole days and you immediately get the cult role if you share video."
      },
      {
         "title": "The Noisy Gobbler",
         "author": "maiden_syn",
         "emoji": "orange_heart",
         "description": "Show us how good you can deep throat a dildo. Make some very throaty noises and moans while you do it. We wanna hear how much you love going deep.",
         "reward": "none"
      },
      {
         "title": "The Dildo/Dick Invaded Your Room and Colonized Your Ass",
         "author": "maiden_syn",
         "emoji": "lock",
         "description": "Fuck yourself with a dildo for {15-30} minutes. Must be cum in or use your own cum/precum to fuck your ass with a dildo.",
         "reward": "Immunity: 3 days"
      },
      {
         "title": "Give Ye Thanks to Chastity Gods for the Bounty of Caged Days Before",
         "author": "maiden_syn",
         "emoji": "poultry_leg",
         "description": "You will remained locked for {3-5} days. No other challenges can be done. Every day you have to talk about why you love chastity so my in #general chat or on twitter tag @houseofchastity. Even if you had immunity prior landing here will will end that.",
         "reward": "Immunity: removes all prior immunity and prevents any immunity going forward for 5 days"
      },
      {
         "title": "Jayde is Gonna Fuck the Whole Football Team this Fall",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "This is a Jayde inspired challenge. Ever have fantasies of being gang banged by the whole football team? Got spirit? Let's hear it bitch! Fuck your ass say ?I want the whole football team to cum in my ass? video or bust",
         "reward": "Immunity: 3 days no cheerleader costume and 7 days if done wearing a cheerleader costume"
      },
      {
         "title": "As American as Anal Sex or Ruined Orgasms",
         "author": "maiden_syn",
         "emoji": "orange_heart",
         "description": "How long is your clitty/dick? If it's 6 inches or bigger then ruined orgasm for you. If below 6 inches anal sex with the toy of choice.",
         "reward": "Immunity: 3 days. No immunity for those that do not post pics of their measurement"
      },
      {
         "title": "Gobbler's Feather Bootyhole Tickle",
         "author": "maiden_syn",
         "emoji": "lock",
         "description": "Use a feather to tickle your butthole. Video required. ",
         "reward": "Immunity: 3 days"
      },
      {
         "title": "A Cornucopia of Lewd",
         "author": "maiden_syn",
         "emoji": "poultry_leg",
         "description": "Let us see the bounty of your sexy toy collection. Take pics of your sex toy collection and share pics then use all your sex toys or at least 5.",
         "reward": "Immunity: 1 day if you share pics of your sex toy collection. 3 days if you share pics of your sex toy collection and video of you using your toys"
      },
      {
         "title": "The Long Slutty Kiss Goodnight",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "We all know you are a cock hungry whore but now it's time to prove it! Use your mouth to lube your dildo to fuck your ass I mean really deep throat it. Do a good job bc this is all the lube you will get.",
         "reward": "Immunity: 0 days without video or pics. Pics 2 days. Video 3 days"
      },
      {
         "title": "A Friend Till the Ruined End",
         "author": "maiden_syn",
         "emoji": "orange_heart",
         "description": "Get on cam and ruin your orgasm for someone on the server while they watch and you cannot see them. No need to show your face. ",
         "reward": "Immunity: 7 days. You need your friend to verify that you did it in challenges"
      },
      {
         "title": "Who Fucking Put Their Dick in My Fanny Pack",
         "author": "maiden_syn",
         "emoji": "lock",
         "description": "This may be a hard item to find but pic of your dick in a fanny pack. If you can't find a fanny pack you can use a purse but a fanny pack would be way better.",
         "reward": "Immunity: 3 days for a purse and 10 days for a fanny pack must have pics to prove it"
      },
      {
         "title": "Slapgiving",
         "author": "maiden_syn",
         "emoji": "poultry_leg",
         "description": "{1-20} slaps you get to the balls and or clitty/dick. Aw no edging or ruins /sadface :smiling_imp: Video preferred.",
         "reward": " Immunity: 3 days"
      },
      {
         "title": "Friends-giving",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "Jerk a friend off IRL or mutually masturbate on video. Do a video call with a friend and jerk it together. Please be honest. We are trusting your work on this one. Let us know how the challenge went.",
         "reward": "Immunity: 7 days"
      },
      {
         "title": "Kinky Sissy Server Hopping with a Friend",
         "author": "maiden_syn",
         "emoji": "orange_heart",
         "description": "Ask a kinky friend to go kinky server hopping with you. Report back any cool lewd things you found",
         "reward": "Immunity: 3 days"
      },
      {
         "title": "Clucky Fucky",
         "author": "maiden_syn",
         "emoji": "lock",
         "description": "Draw or tape feathers on your ass and fuck a dildo extra points if you make turkey noises while you do it. Video is preferred but Pics a must. ",
         "reward": "Immunity: 3 days for feathers drawn and 7 days for feathers taped to the ass"
      },
      {
         "title": "Rambling Gladis Had Too Much to Drink",
         "author": "maiden_syn",
         "emoji": "poultry_leg",
         "description": "Time to bust out the ball gag or a pair or dirty panties and duct tape. Wear the ball gag or dirty panties in your mouth as you struggle to get your drunken ramblings out while you edge. Edge until you get close to a ruin and stop. This will keep your mouthy ass from rambling on! We want video you slut so share it!",
         "reward": "Immunity: days with a ball gag and 5 days with a dirty pair of panties"
      },
      {
         "title": "Stuff the Sissy",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "You will be stuffing more than turkey this year. Take the biggest toy you can take and fuck that ass till you have a ruined orgasm in your cage. ",
         "reward": "Immunity: 3 days if you can complete an ruined orgasm in your cage this way"
      },
      {
         "title": "That Sloppy Sissy is so Cran-Saucey",
         "author": "maiden_syn",
         "emoji": "orange_heart",
         "description": "You knew these sloppy food challenges were coming. Time to uncage and edge with cranberry sauce. Video or bust. ",
         "reward": "Immunity: 7 days"
      },
      {
         "title": "Pretty in Pink Nipple Pinches",
         "author": "maiden_syn",
         "emoji": "lock",
         "description": "In honor of breast cancer awareness month, Wear anything pink you have and pink your nipples playfully till you leak. Pics and or video preferred. This is not part of the challenge but if you donate to any breast cancer charities that would be awesome. Also if you cannot afford to do that please share something on your social media.",
         "reward": "Immunity: 3 days"
      },
      {
         "title": "Pass the Gravy Bitch!",
         "author": "maiden_syn",
         "emoji": "poultry_leg",
         "description": "You knew these food challenges were happening don't act surprised bitch! Pour gravy all over your in caged dick/clitty at this time you can edge if you like but video and or pics of evidence of gravy pouring on your nether regions will get you the immunity you seek.",
         "reward": "Immunity: 10 days"
      },
      {
         "title": "Dungeons and Dragons to Ruin That Orgasm",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "{1-20} edges before your ruined orgasm.",
         "reward": "Immunity: number of edges you were able to complete before your ruined"
      },
      {
         "title": "NOvemBURR",
         "author": "maiden_syn",
         "emoji": "orange_heart",
         "description": "Looks like it's gonna be a cold night bc you will be sleeping in the nude preferably plugged. The only clothes you can wear is a pair of panties.",
         "reward": " Immunity: 3 days and 5 days if you complete it plugged"
      },
      {
         "title": "NOvember Rain",
         "author": "maiden_syn",
         "emoji": "lock",
         "description": "While wearing stockings(or similar), a thong, and mascara if you have it. Put clothes pins on each nipple. Process to repeat starts here: Slap your balls with medium force **{3-5} times. Then suck on a dildo/dick for 2 minutes doing 10 deep throats during that period. If you missed any deep throats its 1 hard ball slap per missed deep throat. :point_up_2:Do this process 5 times. Let's see those tears that rained down your face.",
         "reward": " Immunity: pictures grant 1 day immunity video grants 3 days immunity"
      },
      {
         "title": "Spanksgiving and the JOi(joy) of Edging",
         "author": "maiden_syn",
         "emoji": "poultry_leg",
         "description": "Give that peachy :peach: ass of yours **{1-50} spankings!. Then edge with your favorite joi. No cumming or ruins. We would like video of the spankings mmmk.",
         "reward": "Immunity: 0 days with no video of spankings and 3 days immunity with video of spankings"
      },
      {
         "title": "OMG Edging is My Favorite!",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "Edge with your favorite porn. No cumming or ruins.",
         "reward": "none"
      },
      {
         "title": "Abducted for the Holidays",
         "author": "maiden_syn",
         "emoji": "orange_heart",
         "description": "Spend 1 hour locked in a dark closet naked wearing a blindfold, and with wrists and ankles bound. (Please do this safely as can be done. Make sure you have a way to unbind or unlock yourself) ",
         "reward": "Immunity: 10 days"
      },
      {
         "title": "NO Nipple Left Behind",
         "author": "maiden_syn",
         "emoji": "lock",
         "description": "Place clothes pins on each nipple and one on each one of your balls. Then bounce on a dildo for {15-30} minutes. If any clothes pins fall off early you must flick each of the remaining clothes pins until they pop off. Share video.",
         "reward": "Immunity: If all of the clothes pins remain attached after 30 minutes you gain immunity and for the next 7 days each clothes pin that falls off is minus a day. Minimum days of immunity is 3 days."
      },
      {
         "title": "Naughty NOvember Nights",
         "author": "maiden_syn",
         "emoji": "poultry_leg",
         "description": "Put on your sluttiest clothes/lingerie including heels if you have them, write House of Chastity anywhere on your body then put on a sexy show in front of a mirror so you can see what a naughty slut you are.",
         "reward": "Immunity: Pictures grants 1 day immunity. Video grants 3 days immunity."
      },
      {
         "title": "The Turkey Raises it's Head",
         "author": "maiden_syn",
         "emoji": "maple_leaf",
         "description": "Unlock and tuck your erect penis between your legs and let it pop up. Do this {1-20} times. Once you have completed the task you can edge 1 time before lock up no ruins. Video preferred.",
         "reward": "Immunity: 3 days for pics and 5 days if you share video"
      },
      {
         "title": "Snapsgiving",
         "author": "maiden_syn",
         "emoji": "unicorn",
         "description": "{1-20} rubber band snaps you get on your thighs. Aw no edging or ruins /sadface :smiling_imp: Video preferred. ",
         "reward": "Immunity: 3 days"
      }
   ]
}
