{
   "title": "DeCUMber",
   "host": "House of Chastity",
   "year" : 2019,
   "subtitle": "Santa's Sorority Sluts",
   "emoji": "lock",
   "thumbnail":"https://media.discordapp.net/attachments/548034641085595650/548034836053622795/image0.jpg",
   "description": "Posting challenge pics and videos encouraged as well as daily caged verification photos on discord & on twitter tag us @houseofchastity",
   "tasks": [
      {
         "title": "Dirty Santa",
         "author": "maiden_syn",
         "emoji": "green_heart",
         "description": "Use some dirty socks or panties to shove in your mouth while you fuck your ass saying 'Ho Ho Ho! Merry dickmas!'. When you are done suck on the dildo that you used to fuck your ass. Stay locked!",
         "reward": "Immunity: Ass to Mouth 3 days. With pics or video 1 days. Without pics or video 0 days."
      },
      {
         "title": "Slutty Space Elf Spaces Out",
         "author": "maiden_syn",
         "emoji": "heart",
         "description": "Now is the time to chastity hypno the fuck out and space. Let your mind go and wear either a slutty elf costume or elf ears while you do it. No edging! No cumming! Stay locked!",
         "reward": "Immunity: 0 days."
      },
      {
         "title": "The Mistle-hoe",
         "author": "amalgam",
         "emoji": "snowflake",
         "description": "Break out the mistletoe and the dildo! Time to raise the mistletoe over your head and give your dildo a nice, long, loving kiss. Really suck and make love to it with your mouth. No cumming! Stay locked!",
         "reward": "Immunity: With pics or video 3 days. Without pics or video 0 days."
      },
      {
         "title": "Fixing Santa a Glass of Milk and Cookies (without the cookies)",
         "author": "amalgam",
         "emoji": "santa",
         "description": "Santa will be cumming soon so time to prepare the glass of milk. Cum inside the glass and then drink it. If you drink up all your milk like a goog bitch I might let you have some cookies.",
         "reward": "Immunity: With pics or video 7 days. Without pics or video 3 days."
      },
      {
         "title": "The Peking Dick",
         "author": "maiden_syn",
         "emoji": "snowman",
         "description": "Looks like you will be having Chinese tonight. Get you some packets of peking or sweet-and-sour sauce to put on your dick and edge. No cumming! This challenge will make you \"Cult\" immediately with video proof. Peking sauce on the dick or peking duck with dick.",
         "reward": "Will automatically get you the \"Cult\" role with video or pics and you are immune to the challenges for the next 14 days.",
         "cult": true,
         "thumbnail": "https://media.discordapp.net/attachments/645847684791664653/651543713931067410/image0.gif"
      },
      {
         "title": "DDD for DeCUMber",
         "author": "maiden_syn",
         "emoji": "green_heart",
         "description": "Destroy your Dick December! See how many times you can edge without cumming. Once you cum repeat the process until you can no longer cum.",
         "reward": "Immunity: 7 days but be honest about your challenge and report how many times you edged and how many times you came for immunity."
      },
      {
         "title": "#SaveYourLoadForSanta",
         "author": "amalgam",
         "emoji": "heart",
         "description": "Looks like no matter what you won't be unlocking unless it's for emergency or hygiene clean till Christmas Eve. You can only do challenges that require you to stay locked unless you roll a challenge relieving you of this. Stay locked bitch!",
         "reward": "Immunity: Removed prior to this challenge and after for the remainder of DeCUMber."
      },
      {
         "title": "Merry Dickmas! It's Stocking Stuffing Time!",
         "author": "amalgam",
         "emoji": "snowflake",
         "description": "Time to get stuff your 'stocking'. Get the biggest dildo you can find and really fill up and fuck that ass of yours till you ruin orgasm. Stay locked!",
         "reward": "Immunity: Pics or Video 7 days. Without Pics or Video 3 days."
      },
      {
         "title": "Down the Chimney With Care",
         "author": "amalgam",
         "emoji": "santa",
         "description": "Sounding with a candy cane no not really but you can sound while eating a candy cane. You may unlock for this challenge no cumming or ruins.",
         "reward": "Immunity: Pics or Video 14 Days. Without Pics or Video 3 Days."
      },
      {
         "title": "Santa's Hardworking Sissy Slut Toy Maker Elf",
         "author": "amalgam",
         "emoji": "snowman",
         "description": "Decking those balls with a homemade flogger well or your ass. Make a flogger and spank yourself. Please use the instructions below to help you. Stay locked for this challenge.",
         "links": ["https://www.autostraddle.com/how-to-make-your-own-flogger-in-about-15-minutes-291709/","https://youtu.be/MIvdnS0WkvM", "https://www.walmart.com/ip/100-ft-Polyester-550lb-Test-Commercial-Paracord/42601740?athcpid=42601740&athpgid=athenaItemPage&athcgid=null&athznid=PWVUB&athieid=v0&athstid=CS004&athguid=63ed82d0-7bf-16e434581afbf2&athancid=null&athena=true"],
         "image": "https://media.giphy.com/media/cZkKDI0un2Mrm/giphy.gif",
         "reward": "Immunity: Will automatically make you \"Cult\" and you have immunity for the rest of deCUMber if you share pics using the homemade flogger on yourself and pics of the flogger you are making in various stages of construction. No exceptions.",
         "cult": true,
         "thumbnail": "https://media.discordapp.net/attachments/645847684791664653/651543713931067410/image0.gif"
      },
      {
         "title": "Deck the Balls with Graffiti",
         "author": "maiden_syn",
         "emoji": "green_heart",
         "description": "Write slut or whore on your balls and take pics. Get creative use Christmas colors.",
         "reward": "Immunity: With pics or video 3 days. Without pics or video 0 days"
      },
      {
         "title": "SissySlutNog / CuckNog",
         "author": "amalgam",
         "emoji": "heart",
         "description": "A very fucking gross concoction with cum and nutmeg and yes bitch you will drink it all up!",
         "reward": "Immunity: With pics or video 3 days. Without pics or videos 0 days. Will remove #SaveYourLoadForSanta challenge freeze so you can proceed with your challenges normally with no extra limitation if the challenge is completed with pics or video."
      },
      {
         "title": "Candle Dripping Caroling",
         "author": "amalgam",
         "emoji": "snowflake",
         "description": "Sing Christmas carols naked while dripping wax on yourself",
         "links": "https://www.lovense.com/bdsm-blog/wax-play",
         "reward": "Immunity: With pics or video 7 days. Without pics or video 3 days. Will remove #SaveYourLoadForSanta challenge freeze so you can proceed with your challenges normally with no extra limitation if the challenge is completed with pics or video"
      },
      {
         "title": "Twas the Night Before Christmas and No One Was Cumming Not Even a Big Dick in Your Mouth",
         "author": "amalgam",
         "emoji": "santa",
         "description": "Read 'twas the night before Christmas while bouncing on a dildo.",
         "reward": "Immunity: With pics or video 10 days. Without pics or video 7 days. Will remove #SaveYourLoadForSanta challenge freeze so you can proceed with your challenges normally with no extra limitation if the challenge is completed with pics or video."
      },
      {
         "title": "Merry Christmas Your Shitter's Full",
         "author": "maiden_syn",
         "emoji": "snowman",
         "description": "Clean out your ass thoroughly and fuck while caged to ruined orgasm. Include instructions",
         "image": "https://media3.giphy.com/media/l0ErCh3K9OKnRCKPK/giphy.gif?cid=4d1e4f29e6348607cd236327df1cea8d879e435554a3e21e&rid=giphy.gif",
         "links": "https://howtocleanyourass.wordpress.com/",
         "reward": "Immunity: With pics and video 14 days. Without pics or video 3 days. Will get you automatically the \"Cult\" role with you share video.",
         "cult": true,
         "thumbnail": "https://media.discordapp.net/attachments/645847684791664653/651543713931067410/image0.gif"
      },
      {
         "title": "Booty Hole is a Vegetable",
         "author": "maiden_syn",
         "emoji": "green_heart",
         "description": "Stick a de-cucumber in your ass then eat it preferably in a salad.",
         "reward": "Immunity: With pics or video 5 days. Without pics or video 1 day."
      },
      {
         "title": "It's the Most Locked Up Time of the Year",
         "author": "maiden_syn",
         "emoji": "heart",
         "description": "Nipple play and ass fucking with your favorite toy. Stay caged! You can drip but absolutely no cumming! Video of you doing this while letting Santa know why you have been good this year",
         "reward": "Immunity: with pics or video 5 days. Without pics or video 3 days."
      },
      {
         "title": "Slapping Ethel for Dropping the Ornaments (and Ethel pick them up while you are down there)",
         "author": "maiden_syn",
         "emoji": "snowflake",
         "description": "Well bitch what did I tell you? Hurry up and and decorate the tree so you can make my dinner! You weren't doing it fast enough and so clumsy! Slap your face lightly {1-20} time(s). Then slap your balls {1-20} time(s). You can edge ONLY if you do the slaps. Video required. You may unlock.",
         "image": "https://66.media.tumblr.com/83ed0dec2aa72acd58893e60a4d30a56/tumblr_my6pf0xkvo1qfrhhpo3_r1_250.gifv",
         "reward": "Immunity: with pics and video 5 days. Without pics or video 2 days"
      },
      {
         "title": "It's All Fun and Games 'Til Santa Checks the Naughty List",
         "author": "maiden_syn",
         "emoji": "santa",
         "description": "Looks like you have been naughty only a ruined orgasm. Pics and video with an ornament. Extra immunity if you decorate your balls like an ornament. You May unlock.",
         "reward": "Immunity: With pics or video 5 days. With pics or video of your balls decorated like an ornament 10 days. Without pics or video 2 days."
      },
      {
         "title": "Santa's Slutty Hypno Drone",
         "author": "maiden_syn",
         "emoji": "snowman",
         "description": "Hypno and edge to your favorite hypno. You may unlock no cumming. Remember Santa's watching.",
         "reward": "Immunity: 0 days"
      },
      {
         "title": "It's JOIful(joyfull) Time of Year",
         "author": "maiden_syn",
         "emoji": "green_heart",
         "description": "You can watch your fav JOI and ruin. We all know it's better to give than to receive so do something nice for someone if you feel extra horny afterward.",
         "reward": "Immunity: 0 days"
      },
      {
         "title": "I Pledge to Eat All My Cum For Santa",
         "author": "maiden_syn",
         "emoji": "heart",
         "description": "Watch your favorite CEI  and  have full orgasm that keeps you from cumming for a full week because spoiler alert you are not cumming for the next week.",
         "reward": "Immunity: You cannot cum for the next week even if your next spins for the week call for it. Only ruins are allowed till the 7 days are up."
      },
      {
         "title": "Santa's Sorority Slut Pledge",
         "author": "maiden_syn",
         "emoji": "snowflake",
         "description": "Fuck your ass while you suck on a dildo pics and video required. Now is your chance to pledge for Santa's Sorority. Are you slutty enough for this pledge?",
         "reward": "Immunity: With pics or video 7 days. Without pics or video 0 days."
      },
      {
         "title": "Hazed and Confused",
         "author": "maiden_syn",
         "emoji": "santa",
         "description": "Oh no, the mean girl in the sorority comes up behind you and gives you the worst wedgie you have ever had. So bad you can feel your balls up being pressed inside you. Really give yourself a wedgie in either panties or underwear and show us your cameltoe/ mooseknuckle pics and video required!",
         "reward": "Immunity: With pics or video 3 days. Without pics or video 0 days."
      },
      {
         "title": "All I Want Is For You to Be in Chastity This Christmas",
         "author": "maiden_syn",
         "emoji": "snowman",
         "description": "Darling you would look so beautiful by the glow of the tree. You should disrobe and show off for me. Pic of you in your chastity cage either under or in front of a Christmas tree. Get creative",
         "reward": "Immunity: With pics or video 5 days. Without pics or video 0 days. Will remove #SaveYourLoadForSanta challenge freeze so you can proceed with your challenges normally with no extra limitation if the challenge is completed with pics or video"
      },
      {
         "title": "'Tis the Season For No Orgasms ",
         "author": "maiden_syn",
         "emoji": "green_heart",
         "description": "Aw this sucks really bad for you hun. No matter what you do for the next week no orgasms for you including ruins this erases all previous immunity and any future immunity for 7 days.",
         "reward": "Immunity: No orgasms of any kind (ruined or otherwise) even with prior immunity for the next 7 days. Even future spins you will not be able to have an orgasm until the 7 days are up!"
      },
      {
         "title": "Pa-Rump Pump Pump Pump",
         "author": "maiden_syn",
         "emoji": "heart",
         "description": "Fuck your ass silly to {1,20} sissygasm(s). You must stay caged! Imagine some big hard throbbing cock or femdom dick pumping your boipussy like there is no tomorrow. Videos and pics.",
         "reward": "Immunity: 0 days"
      },
      {
         "title": "The Nutcracker",
         "author": "maiden_syn",
         "emoji": "snowflake",
         "description": "Edge and grab your balls firmly when you feel you are about to cum. I know you want to cum. I know you want it bad but today is not that day. Do not cum. No ruins either",
         "reward": "Immunity: with pics or video 3 days. Without pics or video 1 day"
      },
      {
         "title": "Christmas Bells Are Ringing and Chastity Cages are Jingling",
         "author": "maiden_syn",
         "emoji": "santa",
         "description": "You know what I think would be really cute? Put a bell on your chastity cage and shake around. Make it jingle. Share pics and video",
         "reward": "Immunity: With pics or video 7 days. Without pics or video 0 days."
      },
      {
         "title": "You'll Shoot your Eye Out, Slut",
         "author": "maiden_syn",
         "emoji": "snowman",
         "description": "Time to take your chances and jerk off and this time you have to angle yourself to cum on your own face. Really let that load go and shoot out with force. Pics and video.",
         "reward": "Immunity: With pics or video 14 days and immediate \"Cult\" role! Without pics or videos 0 days",
         "cult": true,
         "thumbnail": "https://media.discordapp.net/attachments/645847684791664653/651543713931067410/image0.gif"
      },
      {
         "title": "The Best Way to Spread Christmas Cheer is Moaning Loud for All to Hear",
         "author": "maiden_syn",
         "emoji": "unicorn",
         "description": "Dress up if you like and fuck your ass or edge but no cumming and moan loudly let me know how much you like it. Pics and video.",
         "image": "https://media.giphy.com/media/sueCeRU3VUTKg/giphy.gif",
         "reward": "Immunity: With pics or video 14 days. Without pics or video 7 days."
      }
   ]
}
